In [1]:
import pandas as pd

In [2]:
%pwd

'c:\\Users\\Shyam\\Desktop\\ml-playground\\data_gathering'

In [3]:
df  = pd.read_csv("data/chocolate_sales.csv")
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04/01/2022,"$5,320.00",180
1,Van Tuxwell,India,85% Dark Bars,01/08/2022,"$7,896.00",94
2,Gigi Bohling,India,Peanut Butter Cubes,07/07/2022,"$4,501.00",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27/04/2022,"$12,726.00",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24/02/2022,"$13,685.00",184
...,...,...,...,...,...,...
3277,Karlen McCaffrey,Australia,Spicy Special Slims,17/05/2024,"$5,303.58",354
3278,Jehu Rudeforth,USA,White Choc,07/06/2024,"$7,339.32",121
3279,Ches Bonnell,Canada,Organic Choco Syrup,26/07/2024,$616.09,238
3280,Dotty Strutley,India,Eclairs,28/07/2024,"$2,504.62",397
3281,Karlen McCaffrey,India,70% Dark Bites,23/05/2024,"$5,915.87",355

In [13]:
# opening the csv file through url 

import requests
from io import StringIO


url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
headers = {"User-Agent":"Mozilla/5.0 (Machintosh; Intel Mac OS X 10:14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url,headers=headers)
data = StringIO(req.text)

df = pd.read_csv(data)

df.to_csv("countries.csv")

## sep parameter in the read_csv()

In [12]:
# if you want to read .tsv files
df  = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t") 
# df
# if you don't have names for the columns then we can pass list column names to the names parameter to reflect on the data
df = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t",names=['negative-comments'])
df

C:\Users\Shyam\AppData\Local\Temp\ipykernel_33084\2745670572.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df  = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t")
C:\Users\Shyam\AppData\Local\Temp\ipykernel_33084\2745670572.py:5: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t",names=['negative-comments'])

                                      negative-comments
0            neg\tØ­ØªÙ‰ Ø§Ù„Ø§ÙŠØªÙˆÙ†Ø² Ø®Ø±Ø¨ØªÙˆÙ‡ Ù…Ùˆ ØµØ§Ø­ÙŠÙ† Ø§Ù†ØªÙˆØŸØŸ ğŸ˜­
1     neg\tÙˆØ§Ø­Ø¯ ØªØ¨Ø¹ Ø§Ù„Ù†Ø¸Ø§Ù… Ø§Ù„Ø³ÙˆØ±ÙŠ ÙŠÙ‚ÙˆÙ„ Ø£Ù† Ø§Ù„Ù…Ø®Ø§Ø¨Ø±Ø§Øª ...
2     neg\tØ§Ù„Ù‰ Ù…ØªÙ‰ Ø§Ù„ØªØ¹Ø§Ù…Ù„ Ø§Ù„Ø³Ø¦ Ù„Ù„Ø®Ø§Ø¯Ù…Ø§Øª ÙˆØ¹Ø¯Ù… Ø§Ø­ØªØ±Ø§Ù…...
3                neg\tØ±Ø§ÙŠØ­ Ø¬Ø§ÙŠ ÙŠ Ø·Ø­Ù„Ø¨ÙŠ ğŸ¸ #Ø§Ù„Ù‡Ù„Ø§Ù„_Ø§Ù„Ø§Ù‡Ù„ÙŠ
4                               neg\tØªØªÙ…ØºØ· ÙˆÙ…Ø¹Ù‡Ø§ Ø³Ø¯Ø§Ø¹ ğŸ˜«
...                                                 ...
5776  neg\tØ§Ù„Ù†ÙˆÙ… ÙˆØ§Ù†Øª Ù…ÙƒØ³ÙˆØ± Ø¯Ù‡ Ø§Ø­Ø³Ø§Ø³ ØºØ¨ÙŠ Ø§Ù„Ù„ÙŠ Ù‡Ùˆ Ù…Ø´ ...
5777  neg\tØ§Ø³ØªØ´Ù‡Ø§Ø¯_Ø§Ù„Ø§Ù…Ø§Ù…_ÙƒØ§Ø¸Ù…_Ø§Ù„ØºÙŠØ¸ Ø§Ù„Ø³Ù„Ø§Ù… Ø¹Ù„Ù‰ Ø§Ù„Ù…Ø¹...
5778                     neg\tØ§Ù†Ø§ ÙƒÙ†Øª Ø§ÙƒÙ„ Ø§Ù„ØµØ­Ù† Ø¨ÙƒØ¨Ø±Ù‡ ğŸ˜
5779  neg\tÙ‚ÙˆÙ„ÙˆØ§ Ù„ÙŠ Ø§ÙŠØ´ ØªØ´ÙˆÙÙˆØ§ .. Ù…Ø¹ Ù…Ù„Ø§Ø­Ø¸Ø© Ø§Ù„ØªÙ„Ø·Ù Ù„...
5780  neg\tâœ Ø¥Ø°Ø§ Ø£Ø±Ø¯Øª Ø£Ù† ØªØ¹Ø±Ù Ø´ÙŠØ¦Ø§ Ø¹Ù†ÙŠ Ø¥Ø³Ø§Ù„Ù†ÙŠ Ù‚Ø¨Ù„ Ø£Ù†...

[5781 rows x 1 columns]

## 1. index_col parameter

In [29]:
df = pd.read_csv("data/countries.csv",index_col="Country")
df = df.drop("Unnamed: 0",axis=1)
df

                  Region
Country
Algeria           AFRICA
Angola            AFRICA
Benin             AFRICA
Botswana          AFRICA
Burkina           AFRICA
...                  ...
Paraguay   SOUTH AMERICA
Peru       SOUTH AMERICA
Suriname   SOUTH AMERICA
Uruguay    SOUTH AMERICA
Venezuela  SOUTH AMERICA

[194 rows x 1 columns]

## 2. Header parameter

In [34]:
# if by mistake the data or the csv file has the first data row as the column names then
# what to do ?

df = pd.read_csv("data/chocolate_sales.csv",header=0) # i can change the header row to any row no
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04/01/2022,"$5,320.00",180
1,Van Tuxwell,India,85% Dark Bars,01/08/2022,"$7,896.00",94
2,Gigi Bohling,India,Peanut Butter Cubes,07/07/2022,"$4,501.00",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27/04/2022,"$12,726.00",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24/02/2022,"$13,685.00",184
...,...,...,...,...,...,...
3277,Karlen McCaffrey,Australia,Spicy Special Slims,17/05/2024,"$5,303.58",354
3278,Jehu Rudeforth,USA,White Choc,07/06/2024,"$7,339.32",121
3279,Ches Bonnell,Canada,Organic Choco Syrup,26/07/2024,$616.09,238
3280,Dotty Strutley,India,Eclairs,28/07/2024,"$2,504.62",397
3281,Karlen McCaffrey,India,70% Dark Bites,23/05/2024,"$5,915.87",355

## use_cols parameter

In [38]:
# used for only getting the wanted columns and nothing more
df = pd.read_csv("data/chocolate_sales.csv",usecols=["Sales Person","Country","Amount"])
df

          Sales Person    Country      Amount
0       Jehu Rudeforth         UK   $5,320.00
1          Van Tuxwell      India   $7,896.00
2         Gigi Bohling      India   $4,501.00
3         Jan Morforth  Australia  $12,726.00
4       Jehu Rudeforth         UK  $13,685.00
...                ...        ...         ...
3277  Karlen McCaffrey  Australia   $5,303.58
3278    Jehu Rudeforth        USA   $7,339.32
3279      Ches Bonnell     Canada     $616.09
3280    Dotty Strutley      India   $2,504.62
3281  Karlen McCaffrey      India   $5,915.87

[3282 rows x 3 columns]

## squeeze parameter

In [41]:
# if you only want one column then we can use sequence to converet a dataframe to series
# constraint use it only when you need one column

# df = pd.read_csv("data/chocolate_sales.csv",usecols=['Sales Person'],squeeze=True)
# the squeeze parameter is depreciated

ser = pd.read_csv("data/chocolate_sales.csv",usecols=["Sales Person"])["Sales Person"]
ser

0         Jehu Rudeforth
1            Van Tuxwell
2           Gigi Bohling
3           Jan Morforth
4         Jehu Rudeforth
              ...
3277    Karlen McCaffrey
3278      Jehu Rudeforth
3279        Ches Bonnell
3280      Dotty Strutley
3281    Karlen McCaffrey
Name: Sales Person, Length: 3282, dtype: object